OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/CMSIS/SVD/py32f001xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIM14</name>
      <description>General purpose timer</description>
      <groupName>TIM</groupName>
      <baseAddress>0x40002000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIM14</name>
        <description>TIM14 global Interrupt</description>
        <value>19</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x0</addressOffset>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>CEN</name>
              <description>desc CEN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDIS</name>
              <description>desc UDIS</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>URS</name>
              <description>desc URS</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OPM</name>
              <description>desc OPM</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ARPE</name>
              <description>desc ARPE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKD</name>
              <description>desc CKD</description>
              <bitRange>[9:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <description>desc DIER</description>
          <addressOffset>0xC</addressOffset>
          <resetMask>0x5F5F</resetMask>
          <fields>
            <field>
              <name>UIE</name>
              <description>desc UIE</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IE</name>
              <description>desc CC1IE</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x10</addressOffset>
          <resetMask>0x1E5F</resetMask>
          <fields>
            <field>
              <name>UIF</name>
              <description>desc UIF</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IF</name>
              <description>desc CC1IF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC1OF</name>
              <description>desc CC1OF</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC1IR</name>
              <description>desc IC1IR</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <description>desc IC1IF</description>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <description>desc EGR</description>
          <addressOffset>0x14</addressOffset>
          <access>write-only</access>
          <resetMask>0x5F</resetMask>
          <fields>
            <field>
              <name>UG</name>
              <description>desc UG</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CC1G</name>
              <description>Capture/Compare 1 Generation</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_OUTPUT</name>
          <description>desc CCMR1:OUTPUT</description>
          <addressOffset>0x18</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC1PE</name>
              <description>desc OC1PE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC1M</name>
              <description>desc OC1M</description>
              <bitRange>[6:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_INPUT</name>
          <description>desc CCMR1:INPUT</description>
          <alternateRegister>CCMR1_OUTPUT</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC1PSC</name>
              <description>desc IC1PSC</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC1F</name>
              <description>desc IC1F</description>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCER</name>
          <description>desc CCER</description>
          <addressOffset>0x20</addressOffset>
          <resetMask>0x3333</resetMask>
          <fields>
            <field>
              <name>CC1E</name>
              <description>desc CC1E</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1P</name>
              <description>desc CC1P</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC1NP</name>
              <description>desc CC1NP</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>desc CNT</description>
          <addressOffset>0x24</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>desc PSC</description>
          <addressOffset>0x28</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PSC</name>
              <description>desc PSC</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <description>desc ARR</description>
          <addressOffset>0x2C</addressOffset>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ARR</name>
              <description>desc ARR</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>desc CCR1</description>
          <addressOffset>0x34</addressOffset>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CCR1</name>
              <description>desc CCR1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OR</name>
          <description>desc OR</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>TI1_RMP</name>
              <description>desc TI1_RMP</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>